Revit 2027 API
MassLevelData.IsEmpty Method
 Indicates if the MassLevelData (Mass Floor) has a geometrical representation. May not if the level does not intersect the mass geometry.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEmpty()
Public Function IsEmpty As Boolean
public:
bool IsEmpty()
member IsEmpty : unit -> bool
Return Value
Boolean
 Returns True if MassLevelData is dimensionless, False otherwise.
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace